const QS = [ 
  {
    Q: "شئ يسقط على الرأس ولا يجرح؟",
    A: "المطر"
  },
  {
    Q: "حيوان لم يركب سفينة نوح؟",
    A: "السمك"
  },
  {
    Q: "أخوة لا يمضيان أكثر من دقيقة معًا؟",
    A: "عقارب الساعة"
  },
  {
    Q: "شئ إذا لمسته صاح أو صرخ؟",
    A: "الجرس"
  },
  {
    Q: "شئ يبيعه صانعه، ولا يستخدمه شاريه، ومستخدمه لا يراه؟",
    A: "الكفن"
  },
  {
    Q: "شئ يتنفس دون روح؟",
    A: "الصبح"
  },
{
    Q: "شئ لا يمشي إلا بالضرب؟",
    A: "المسمار"
  },
  {
    Q: "شئ له ورق وليس له جذور؟",
    A: "الكتاب"
  },
  {
    Q: "جامعة خالية من الطلاب؟",
    A: "جامعة الدول العربية"
  },
  {
    Q: "شهر ميلادي إذا حذفت أول حرف منه اصبح فاكهة؟",
    A: "تموز"
  },
  {
    Q: "مدينة لا يطحن فيها الدقيق ولا يموت فيها الميت؟",
    A: "كل المدن",
    S: "لأن الميت لا يموت و الدقيق لا يطحن ._."
  },
  {
    Q: "منزل من طابق واحد كل شئ فيه أصفر، الجدران، والأبواب، والأثاث فما لون السلم؟",
    A: "لا يوجد سلم"
  },
  {
    Q: "أمامك دائمًا ولكن لا تراه؟",
    A: "المستقبل"
  },
  {
    Q: "سؤال لا يمكنك الإجابة عليه بنعم؟",
    A: "هل ما زلت نائم إلى الآن"
  },
  {
    Q: "ملئ بالثقوب ويحمل الماء؟",
    A: "الأسفنج"
  },
  {
    Q: "إذا أكلت نصفه تموت وإذا أكلته كاملاً تستفيد به؟",
    A: "السمسم"
  },
  {
    Q: "يمشي ويقف وليس له أرجل؟",
    A: "الساعة"
  },
  {
    Q: "لا يبتل حتى وإن دخل الماء؟",
    A: "الضوء"
  },
  {
    Q: "إن ابتسمت لها ابتسمت لك فمن هي؟",
    A: "المرآة"
  },
  {
    Q: "يمر عبر المدن ولا يتحرك؟",
    A: "الطريق"
  },
  {
    Q: "رقم إذا ضربته في نفسه أو أضفت له 5 يصبح 30؟",
    A: "5"
  },
  {
    Q: "شئ يجب كسره قبل استخدامه؟",
    A: "البيض"
  },
  {
    Q: "طويل عندما أكون صغير، وقصير عندما أكبر؟",
    A: "الشمعة"
  },
  {
    Q: "شهر به 28 يومًا؟",
    A: "كل شهور السنة"
  },
  {
    Q: "مشى رجل أسفل المطر دون قبعة أو مظلة فلم يبتل شعره لماذا؟",
    A: "لأنه أصلع"
  },
  {
    Q: "يمكنك كسره دون أن تلمسه؟",
    A: "الوعد"
  },
  {
    Q: "يتقدم ولا يعود؟",
    A: "العمر"
  },
  {
    Q: "إذا نطق اسمه كسر؟",
    A: "الصمت"
  },
  {
    Q: "يريدونني في الأماكن العامة، ويخشونني على انفراد؟",
    A: "الحقيقة"
  },
  {
    Q: "الغبي يضيعني، العادي ينفقني، والحكيم يستثمرني؟",
    A: "الوقت"
  },
  {
    Q: "لا قيمة لأحدهما دون الآخر؟",
    A: "الحذاء"
  },
  {
    Q: "ينمو ولا يتنفس ولكن يحتاج إلى الهواء؟",
    A: "الحريق"
  },
  {
    Q: "يمتلك بحيرات بلا ماء، وأراضي بلازرع، وجبال بلا أحجار؟",
    A: "الخريطة"
  },
  {
    Q: "سيد وسيدة لديهما ست بنات وكل ابنة لها أخ واحد، كم عدد أفراد العائلة ؟",
    A: "تسعة"
  },
  {
    Q: "من هو ابن الماء ولكنه يموت إذا وضعناه في الماء؟",
    A: "الثلج"
  },
  {
    Q: "أخضر في الأرض، وأسود في السوق، ويكون أحمر في البيت؟",
    A: "الشاي"
  },
  {
    Q: "ما هو السلم الذي لا يمكن لأحد أن يصعد عليه؟",
    A: "سلم الرواتب"
  },
  {
    Q: "شيء مفيد وغير مؤذي، يغلب الجميع، فما هو؟",
    A: "النوم"
  },
  {
    Q: "هناك سبعة أشخاص في مجلس، صافحوا بعضهم مرة واحدة، كم عدد المصافحات؟ (أكنب الرقم بالأرقام)",
    A: "21"
  },
  {
    Q: "شيء يغير اتجاهه أعلى أو أسفل بلا حركة، ما هو؟",
    A: "السلم"
  },
  {
    Q: "كيف نضع الماء في الغربال؟",
    A: "نجمده"
  },
  {
    Q: "كم يساوي البليون؟",
    A: "ألف مليون"
  },
  {
    Q: "ما يشبه نصف القمر؟",
    A: "النصف الآخر"
  },
  {
    Q: "ما هو الشيء الذي تراه في السماء ولا تراه في الماء؟",
    A: "حرف السين"
  },
  {
    Q: "ما هو الشيء اللانهائي في البداية والنهاية؟",
    A: "الدائرة"
  },
  {
    Q: "ما هو الشيء الذي يستطيع الجري بدون استخدام الأرجل؟",
    A: "النهر"
  },
  {
    Q: "ما هو الطعام الذي لا تتغير درجة حرارته؟",
    A: "الفلفل"
  },
  {
    Q: "ماذا يقع في منتصف باريس؟",
    A: "حرف الراء"
  },
  {
    Q: "ما هو الشيء الذي يتبع القطة في كل مكان تذهب إليه؟",
    A: "الذيل"
  },
  {
    Q: "ما هو الشيء الذي لا يشبع أبدًا؟",
    A: "النار"
  },
  {
    Q: "ماذا نراه في السماء وإذا أضفنا له حرفًا نراه في الأرض؟",
    A: "النجم",
    S: "يصبح منجم إذا أضفنا له حرف ._."
  },
  {
    Q: "ما اسم الحيوان الذي يشم بلسانه ويتنفس بفمه؟",
    A: "الثعبان"
  },
  {
    Q: "ما هو البيت الذي ليس له أبواب أو نوافذ؟",
    A: "بيت الشعر"
  },
  {
    Q: "ما هي الشجرة التي لا تحمل ثمارًا؟",
    A: "شجرة العائلة"
  },
  {
    Q: "ما هو الشيء الذي يحيط بك دائمًا ولا يمكنك رؤيته؟",
    A: "الهواء"
  },
  {
    Q: "ما هو الشيء الذي يمكنه الكتابة دون القراءة؟",
    A: "القلم"
  },
  {
    Q: "اذكر اسم الشيء الذي لا يظهر في الساعة ولكننا نجده في الدقيقة مرتين وفي القرن مرة؟",
    A: "حرف القاف"
  },
  {
    Q: "شيء يقرصك ولكنك لن تراه أبدًا، فما هو؟",
    A: "الجوع"
  },
  {
    Q: "ما هو الشيء الذي يوجد بين السماء والأرض؟",
    A: "حرف الواو"
  },
  {
    Q: "رقم عندما تضيف له نفسه ونصفه يصبح عشرة، فما هو؟",
    A: "الرقم أربعة"
  },
  {
    Q: "ما الشيء الذي تذبحه بإرادتك ورغم ذلك تبكي عليه؟",
    A: "البصل"
  },
  {
    Q: "ما هو الشيء الذي يمكنك رؤيته في وسط النهار مرة واحدة وفي وسط الليل ثلاث مرات؟",
    A: "حرف اللام"
  },
  {
    Q: "ما اسم الشيء الوحيد الذي يوقف تساقط الشعر؟",
    A: "الأرض"
  }
]

module.exports = {
  QS
};