/*const H = "📜 قصة اللعبة:\n\n❏ والدتك ارسلتك الى السيد والسيدة ادامز لانهم راعوك في صغرك وطلبو قدومك اليهم لسبب مجهول\n\n📝 القواعد:\n\n❏ لا تضحك\n❏ الإحترام واجب\n❏ لا تتكلم على الطاولة\n❏ الإستئذان دوما\n\n🤔 هل أنت مستعد للذهاب ؟\n\n⚔️ صنعها Rayen Dridi 👽";

const C = [
  {
    QS: "لقد وصلت لمنزل السيد والسيدة ادامز ماذا تفعل ؟",
    A: { action: "تطرق الباب قبل الدخول.", result: "فرحو من تصرفك وادخلوك😊☑️", ratio: 100 },
    B: { action: "تدخل مباشرة", result: "قتلوك ❌ عليك الاستئذان", ratio: 0 },
    C: { action: "تنضر لداخل المنزل من النافذة", result: "انزعجو من تصرفك لكنك نجوت 🙂☑️", ratio: 50 }
  },
  {
    QS: "بعد دخولك المنزل وجدت طاولة مليئة بالطعام ماذا تفعل؟",
    A: { action: "تنظر للطعام بتقزز وترفض الجلوس", result: "غضبت 😠 السيدة وقتلتك 😱 لانك رفضت الجلوس لقد خسرت❌", ratio: 0 },
    B: { action: "تستأذن قبل الجلوس😘", result: "😊☑️فرحت السيدة وزوجها من تصرفك", ratio: 100 },
    C: { action: "تسخر من طعام السيدة🙂", result: "غضب زوجها 😠 وقام بطعنك خسرت❌", ratio: 0 }
  },
  {
    QS: "بعد جلوسك للأكل ماذا ستفعل 🤔",
    A: { action: "تتكلم عن رحلتك اثناء الأكل..", result: "غضبو 😠 منك وقتلوك ❌ ممنوع الحديث على الطاولة", ratio: 0 },
    B: { action: "تأكل بصمت 🤫", result: "تصرف جيد لقد نجوت ☑️", ratio: 100 },
    C: { action: "تقول للسيد والسيدة ادامز انهم مخيفين..", result: "غضبت السيدة وقامت بخنقك لقد خسرت ❌", ratio: 0 }
  },
  {
    QS: "بعد انهاء الأكل طلبو منك اختيار فلم للسهرة..ماذا تختار؟",
    A: { action: "فلم كوميدي", result: "خسرت هم يكرهون الضحك ❌", ratio: 0 },
    B: { action: "فلم رعب", result: "اعجبهم اختيارك لقد نجوت ☑️", ratio: 100 },
    C: { action: "خيال علمي", result: "لم يعجبهم اختيارك لكنهم لم يفعلو شيء نجوت", ratio: 50 }
  },
  {
    QS: "أثناء مشاهدة الفلم شعرت بالنعاس 😴 ماذا تفعل؟ ",
    A: { action: "تذهب مباشرة للغرفة", result: "خسرت❌ غضب السيد وقام بقتلك عليك الاستئذان😠", ratio: 0 },
    B: { action: "تستأذن للذهاب للغرفة", result: "لقد سمحو لك نجوت😊☑️", ratio: 100 },
    C: { action: "تنام على الأريكة", result: "انزعجت ‼️ السيدة وأيقضتك-اذهب للغرفة", ratio: 50 }
  },
  {
    QS: "المرحلة الثانية🔥\nعندما ذهبت للغرفة تفاجأت بوجود باب ثاني في الغرفة..عندما ذهبت لفتحه سعرت بيد تمسك كتفك بقوة ماذا تفعل؟",
    A: { action: "تخاف وتلتفت بسرعة😱", result: "كانت السيدة ادامز وهي منزعجة واخبرتك الا تفتح الباب نجوت..", ratio: 50 },
    B: { action: "ترصخ 😱", result: "لقد خسرت❌ قامت السيدة بكسر رقبتك ", ratio: 0 },
    C: { action: "تلتفت بهدوء😱", result: "ناضرتك السيدة بلطف واخبرتك ان تخلد للنوم ولا تفتح الباب😁", ratio: 100 }
  },
  {
    QS: "فعلت ماقالته لك السيدة وذهبت للسرير رغم فضولك وتسائلك على الباب.. اثناء نومك سمعت صوت موسيقى بالأسفل...\nعند نزولك للاسفل وجدت السيدة والسيد يرقصون بغرابة ماذا تفعل؟",
    A: { action: "تناضرهم ثم تعود لغرفتك", result: "لم يلاحضوك واكملو الرقص☑️نجوت", ratio: 100 },
    B: { action: "تخبرهم ان الموسيقى مزعة", result: "ناضرتك السيدة بغضب وطلبت منك العودة للغرفة وعدم ازعاجهم.. نجوت", ratio: 50 },
    C: { action: "تغلق الموسيقى فورا", result: "لقد خسرت ❌ قام السيد بضربك حتى الموت", ratio: 0 }
  },
  {
    QS: "عندما ذهبت للنوم 😪سمعت صوت غريب😥 قادم من باب الغرفة الغريب وكان احدهم يصرخ😱...كنت ستذهب لرؤية مايحدث لكنك سمعت خطوات مسرعة قادم نحو الغرفة فماذا ستفعل🧐؟",
    A: { action: "تتصنع النوم", result: "كانت السيدة ادامز هي من اتت وخرجت عندما راتك نائم لقد نجوت☑️", ratio: 100 },
    B: { action: "تناظر باب الغرفة حتى ترى من سياتي..", result: "كشفتك السيدة وقامت بقتلك لقد خسرت❌", ratio: 0 },
    C: { action: "تضع الغطاء على وجهك", result: "دخلت السيدة وكشفت عن وجهك.. انت لست نائم,امت بقتلك لقد خسرت❌", ratio: 0 }
  },
  {
    QS: "أثناء تصنعك النوم نمت بالفعل..في اليوم التالي اثناء نزولك من الطابق العلوي كان السيد ادامز يناضرك بغرابة واخبرك ان والدتك اتصلت لتسأل عنك.. ماذا تقول لها؟",
    A: { action: "تطلب منها ان تاتي وتاخذك لانك لست مرتاح معهم", result: "يغضب السيد ادامز ويكسر عنقك لقد خسرت❌", ratio: 0 },
    B: { action: "تخبرها انك سعيد جدا مع الزوجين ادامز", result: "يفرح السيد ادامز لقد نجوت☑️", ratio: 100 },
    C: { action: "تخبرها انهما لطيفان معك وتضحك", result: "ممنوع الضحك لقد خسرت❌ قتلك السيد", ratio: 0 }
  },
{
    QS: "بعد انتهاء المكالمة اخبرتك السيدة ادامز انهم سيذهبون للسوق وطلبو منك عدم الخروج ماذا تفعل؟",
    A: { action: "تقول حسنا باحترام", result: "تبتسم لك السيدة لقد نجوت", ratio: 100 },
    B: { action: "تخبرها انه لا شان لها", result: "طعنتك حتى الموت لقد خسرت❌", ratio: 0 },
    C: { action: "تتجاهلها", result: "غضبت لكنها مستعجلة لقد نجوت☑️", ratio: 50 }
  },  
  {
    QS: "عندما خرجو اخذت هاتفك📱 وذهبت نحو ذلك الباب🚪 الغريب حيث سمعت الصراخ..بعد دخولك رايت مشهدا مروعا😱 من دماء😨 ولحوم ورائحة قذرة 🤢واصلت التقدم حتى وجدت خنزير يقف على قدميه 😱يقطع اللحم ماذا تفعل؟",
    A: { action: "تختبأ بسرعة كي لا يراك", result: "لم يلاحضك الخنزير وذهببعيظا عنك لقد نجوت☑️", ratio: 100 },
    B: { action: "تقول له مرحبا", result: "تسلم عليه لماذا يا احمق قتلك لقد خسرت❌", ratio: 0 },
    C: { action: "تنضر اليه بصدمة", result: "قتلك لقد خسرت❌", ratio: 0 }
  },
  {
    QS: "المرحلة الثالثة والاخيرة🔥\nبعد ذهاب الخنزير سمعت صراخ فتاة تستغيث لكنك كنت خائف ان تدخل ويمسكك الخنزيل انتضرت حتى ذهابه وتسللت للغرفة...عند دخولك وجدت فتاة تبكي ومليئة بالاصابات اخبرتك ان السيدة ادامز وزوجها احتجزوها هنا والخنزير يقوم بتعذيبها وسوف يقتلها..\n نضرت لها ماذا ستفعل؟",
    A: { action: "تتجاهلها وتخرج", result: "بدات في الصراخ كشفك الخنزير وقتلك لقد خسرت❌", ratio: 0 },
    B: { action: "توافق على مساعدتها", result: "فرحت جدا وشكرتك☑️", ratio: 100 },
    C: { action: "تعتذر لها وتذهب", result: "سمعك الخنزير وقتلك لقد خسرت❌", ratio: 0 }
  },
  {
    QS: "بعد خروجكم من الغرفة وانت تحملها ظهر الخنزير امامكم وفي يده مطرقة مذا ستفعل؟",
    A: { action: "تصرخ", result: "امسك بك وقتلك لقد خسرت❌", ratio: 0 },
    B: { action: "تبقى هادءا", result: "امسك بك وقتلك لقد خسرت❌", ratio: 0 },
    C: { action: "ترمي عليه قطعة من اللحم وتهرب", result: "كانت القطعة كبيرة لقد وقع وتمكنت من الهرب☑️", ratio: 100 }
  },
  {
    QS: "نزلت للطابق السفلي وجدت السيدة ادامز وزوجها يناضرنوك بغرابة وفي يد السيد ادامز راس طفل ماذا تفعل؟",
    A: { action: "تصرخ بفزع", result: "اقترب السيد ادامز منك وقتلك لقد خسرت❌", ratio: 0 },
    B: { action: "تناظر الرأس وتحاول تمالك اعصابك", result: "تركك الزوجين وذهبو للمطبخ لقد نجوت☑️", ratio: 100 },
    C: { action: "تناظر الرأس بصدمة", result: "ناضرتك السيدة بغضب ادامز وقالت لما الصدمة انه مجرد راس لقد نجوت كن حذرا", ratio: 50 }
  },
  {
    QS: "جلست تفكر قليلاً ثم طلب من السيدة ادامز وزوجها الذهاب للقبو لانك سمعت ضجيج هناك وذهب السيدان ماذا ستفعل؟",
    A: { action: "تغلق عليهم الباب بالمفتاح", result: "نجحت وخدعتهم ☑️", ratio: 100 },
    B: { action: "تنزل معهم", result: "وجدك الخنزير وقام بقتلك لقد خسرت ❌", ratio: 0 },
    C: { action: "تضل واقف عند الباب", result: "شكو فك وقتلوك لقد خسرت ❌", ratio: 0 }
  },
]

module.exports = { c: C, h: H };*/
const H = "📜 قصة اللعبة:\n\n❏ الذكاء الإسطناعي يتطور كثيرا و مجموعة من العلماء صنعوا رجل آلي ذكي و إنقلب عليهم و قتلهم و طور جيشه ليغزوا كوكب الأرض.\n⚔️ مهمتك هي إيقاف الجيش و تدميرهم قبل أن يصلوا إلى هدفهم لاكن إحذر أن يتم خداعك لأن شكلهم يشبه البشر كثيرا. حاول أن تجمع جيش من الناجيين و الأسلحة لتدميرهم عن طريق تفجير سيرفر الذكاء الإسطناعي الموجود في برج بمنطقة إسمها منطقة ISP-a.\n\n💀 آر يو ريدي ؟";

const C = [
  {
    QS: "أنت في منطقة و معك سلاح شوت غن و لا يوجد فيها أي بشري. بدأت بالتقدم للخروج من المنطة و صادفت رجل غريب مذا تفعل ؟",
    A: { action: "تذهب له لينضم لك .", result: "هو مش بشري هو بوت قام بقتلك.", ratio: 0 },
    B: { action: "تفجر له رأسه بالشوت غن", result: "مات و حصلت على ذخيرة سلاحه و نجوت.", ratio: 100 },
    C: { action: "تذهب و تتجاهله مكملا طريقك.", result: "لمحك من بعيد و فجر لك رأسك", ratio: 0 }
  },
  {
    QS: "خرجت من المنطقة الأولى و دخلت منطقة صناعية مذا تفعل ؟",
    A: { action: "تبحث عن بشر ؟", result: "لقد متت من الجوع.", ratio: 0 },
    B: { action: "تبحث عن طعام لأنك جائع جدا", result: "لم تجد و أغمي عليك", ratio: 50 },
    C: { action: "تبحث في المنطقة عن أي شيئ مفيد ", result: "وجدت بعض الأدوية و الذخيرة و الطعام المخزن و نجوت و وجدت أيضا كلمة سر مكتوب عليها ai-is-danger-force-stop ستحتاجها لاحقا.", ratio: 100 }
  },
  {
    QS: "تجد نفسك فجأة في مكان مليئ بالروبوتات و تسمع صراخ تجمع بشري و صوت إطلاق النار في كل مكان مذا تفعل ؟",
    A: { action: "تحارب الروبوتات وحدك ؟", result: "تموت هم أقوى منك ", ratio: 0 },
    B: { action: "تذهب نحو البشر بسرعة و جري", result: "تقتلك الروبوتات في الطريق", ratio: 0 },
    C: { action: "تحاول التسلل متخفيا إلى البشر", result: "لقد وصلت لهم بنجاح", ratio: 100 }
  },
  {
   QS: "بعدها قالوا لك من أنت و هل تعمل لصالح الروبوتات و هددوك بالسلاح. لاكنهم تأكدوا أنك لست مع الروبوتات و سألوك عن طريقة لإيقاف الروبوتات.\nما هي المنطقة التي فيها برج سيرفر الذكاء الإسطناعي ؟",
   A: { action: "المنطقة Isl-a.", result: "خطأ لقد تطورت الروبوتات و دمرت العالم.", ratio: 0 },
   B: { action: "المنطقة Ips-a.", result: "خطأ لقد تطورت الروبوتات و دمرت العالم.", ratio: 0 },
   C: { action: "المنطقة Isp-a", result: "صحيح أنتم ذاهبون للمنطقة.", ratio: 100 }
  },
  {
   QS: "بعد وصولكم إقترح فرد منكم الهجوم البربري مباشرة على البرج و هذا الشخص الأول و الثاني طلب منكم الذهاب و هو البقاء و حماية ضهركم مع ثلاثة أشخاص آخرين أما الشخص الثالث قال لنرمي قنبلة بواسطة أيدينا نحو البرج و سينفجر السيرفر.\nأي خطة تراها ذكية و مناسبة و أي شخص محق ؟",
   A: { action: "الشخص الأول.", result: "تم رصدكم و قتلكم لقد خسرت و فازت الروبوتات.", ratio: 0 },
   B: { action: "الشخص الثاني.", result: "أحسن خيار !", ratio: 100 },
   C: { action: "الشخص الثالث.", result: "فكرة غبية مثلك و مثله لقد متتم.\nيا غبي برج يعني شي طويل كيف ترمي قنبلة بيدك بالله عليك ._. ؟", ratio: 0 }
  },
  {
   QS: "بقوا لحراسة ضهركم و أنتم توجهتم نحو البرج ثم دخلتم.\nهنا مذا تفعل داخل البرج برئيك ؟",
   A: { action: "تتسلل مع الفريق و تدمرون الروبوتات الحارسة بحذر و خفية", result: "فكرة جيدة.", ratio: 100 },
   B: { action: "تتفرقون للبحث عن الجهاز الذي يشغل السيرفر لتعطيله.", result: "لا تتفرقوا الروبوتات قوية تم قتلكم !", ratio: 0 },
   C: { action: "تجري بعيدا عن الفريق للبحث عن الجهاز الذي يشغل السيرفر و تدميره", result: "فكرة شجاعة لاكنك تم صيدك مثل الحشرة و قتلك هه لا تتفرق !", ratio: 0 }
  },
  {
   QS: "بعد العناء الطويل دخلتم ووجدت الجهاز و زر إيقاف و تدمير الجهاز و طلب منك كلمة السر التي حصلت عليها سابقا ما هي ؟\nفقط إن لعبت بمهارة ستكون قد وجدت كلمة السر 😉.",
   A: { action: "1234-ssl-dest.", result: "تم تفجيركم الكلمة غير صحيحة", ratio: 0 },
   B: { action: "1036-@antiBot-destroy-ai-is-danger-force-stop", result: "كلمة سر خطأ تم تفجيركم !", ratio: 0 },
   C: { action: "1973576-ai-is-danger-force-stop", result: "صحيح تم تدمير السيرفر و إنقاذ العالم أحسنت 😎\n\n-قصة من طرف allou mohamed شكرا على اللعب.", ratio: 100 }
  }
]

module.exports = { c: C, h: H };